""""
__author__ = 'huyuxin
date = 2019/9/8

这个项目的设想是将输入的文字所描述的画面通过图画的方式呈现出来
阶段1 所有的素材都是灰度的，没有色彩
步骤1 将输入的文字中的名词识别，找到素材库中的对应
步骤2 识别出文字名词及说明方位的名词 将素材按照出现顺序和方位进行摆放
步骤3 识别出文字名词，对应方位和大小，再进行摆放
阶段2 呈现彩色图片
步骤4 识别出物品名词，对应方位大小色彩，进行摆放
步骤5 确定风格词对应的色彩饱和度修改整体色彩
步骤6 确定绘画风格，将实体素材转化为对应画风下的图画
阶段3
步骤7 提供交互功能，修改画面，例如：太阳再红一些，花朵颜色淡一点
步骤8 所有交互修改会同步进完整的文段
步骤9 确定自身喜好模板，支持个人语言的特点和图画对应
阶段4
步骤10 提供工具，画笔、颜色、模糊等以修改
步骤11 将修改的动作识别，修改至文段描述中
。修改
。修改
。修改
。修改

# 新想法： 根据已有素材抽象绘画风格，例如：实体照片抽象为速写、不假的（素描、油画、国画、水粉等）
#
"""

if __name__ == '__main__':
    print('totally new and difficult!')
